# VectorAtPoint Properties (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
VectorAtPoint Properties
VectorAtPoint Class See Also
---
The VectorAtPoint type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| IsValidObject | Specifies whether the .NET object represents a valid Revit entity.  (Inherited from ValueAtPointBase.) |

# See Also
VectorAtPoint Class
Autodesk.Revit.DB.Analysis Namespace